Dlubal.RFEM5.NodalRelease
Nodal release parameters

Dlubal.RFEM5.NodalRelease.No
Number

Dlubal.RFEM5.NodalRelease.ID
Identifier

Dlubal.RFEM5.NodalRelease.Comment
Comment

Dlubal.RFEM5.NodalRelease.Tag
Tag

Dlubal.RFEM5.NodalRelease.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.NodalRelease.NodeNo
Node number

Dlubal.RFEM5.NodalRelease.MemberHingeNo
Member hinge number

Dlubal.RFEM5.NodalRelease.AxisSystem
Type of local axis system

Dlubal.RFEM5.NodalRelease.AxisSystemFromObjectNo
Take local axis system from object number

Dlubal.RFEM5.NodalRelease.ReleasedMembers
List of released members numbers

Dlubal.RFEM5.NodalRelease.ReleasedSurfaces
List of released surfaces numbers

Dlubal.RFEM5.NodalRelease.ReleasedSolids
List of released solids numbers

Dlubal.RFEM5.NodalRelease.Location
Location of member hinge

Dlubal.RFEM5.NodalRelease.GeneratedNodeNo
Generated released node number (read only)